In [21]:
# Launch Spark ipython notebook

"""
** RUN SPARK NOTEBOOK : 

$ source activate J_env ;  cd NOTEBOOK ; IPYTHON_OPTS="notebook" /Users/GGV/spark/./bin/pyspark


** RUN SPARK NOTEBOOK and processing CSV files with Spark SQL 

$ source activate J_env ;  cd NOTEBOOK ; IPYTHON_OPTS='notebook' /Users/GGV/spark/./bin/pyspark --packages com.databricks:spark-csv_2.11:1.2.0

"""

'\n** RUN SPARK NOTEBOOK : \n\n$ source activate J_env ;  cd NOTEBOOK ; IPYTHON_OPTS="notebook" /Users/GGV/spark/./bin/pyspark\n\n\n** RUN SPARK NOTEBOOK and processing CSV files with Spark SQL \n\n$ source activate J_env ;  cd NOTEBOOK ; IPYTHON_OPTS=\'notebook\' /Users/GGV/spark/./bin/pyspark --packages com.databricks:spark-csv_2.11:1.2.0\n\n'

In [1]:
sc

In [2]:
import datetime as dt   
import time
import csv
import requests
import pandas as pd, numpy as np

In [3]:
# pandas dataframe  

pdf=pd.read_csv('/Users/GGV/Desktop/test.csv')
pdf.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [23]:
# Spark dataframe 

df = sqlCtx.createDataFrame([(1, 4), (2, 5), (3, 6)], ["A", "B"])
df.show()

+---+---+
|  A|  B|
+---+---+
|  1|  4|
|  2|  5|
|  3|  6|
+---+---+

In [22]:
# Spark read .csv as dataframe 

df_ = sc.textFile("/Users/GGV/Desktop/test.csv")
df_ = df_.map(lambda x: (x, )).toDF()
df_.show()

+--------------------+
|                  _1|
+--------------------+
|PassengerId,Pclas...|
|892,3,"Kelly, Mr....|
|893,3,"Wilkes, Mr...|
|894,2,"Myles, Mr....|
|895,3,"Wirz, Mr. ...|
|896,3,"Hirvonen, ...|
|897,3,"Svensson, ...|
|898,3,"Connolly, ...|
|899,2,"Caldwell, ...|
|900,3,"Abrahim, M...|
|901,3,"Davies, Mr...|
|902,3,"Ilieff, Mr...|
|903,1,"Jones, Mr....|
|904,1,"Snyder, Mr...|
|905,2,"Howard, Mr...|
|906,1,"Chaffee, M...|
|907,2,"del Carlo,...|
|908,2,"Keane, Mr....|
|909,3,"Assaf, Mr....|
|910,3,"Ilmakangas...|
+--------------------+
only showing top 20 rows

In [34]:
# read CSV with PySpark SQL 

from pyspark.sql import SQLContext
sqlContext = SQLContext(sc)


df_test = sqlContext.read.format('com.databricks.spark.csv').options(header='true', inferschema='true').load('/Users/GGV/Desktop/test.csv')

In [35]:
type(df_test)

pyspark.sql.dataframe.DataFrame

In [36]:
df_test.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [37]:
df_test.columns

['PassengerId',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [39]:
df_test.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292|     |       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0|     |       S|
|        894|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875|     |       Q|
|        895|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625|     |       S|
|        896|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875|     |       S|
|        897|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225|     |       S|
|        898|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292|     |       Q|
|        899|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0|     |       S|
|        900|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292|     |       C|
|        901|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15|     |       S|
|        902|     3|    Ilieff, Mr. Ylio|  male|null|    0|    0|          349220| 7.8958|     |       S|
|        903|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0|     |       S|
|        904|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0|     |       S|
|        906|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208|     |       C|
|        908|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35|     |       Q|
|        909|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225|     |       C|
|        910|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925|     |       S|
|        911|     3|Assaf Khalil, Mrs...|female|45.0|    0|    0|            2696|  7.225|     |       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [45]:
# make pyspark dataframe as SQL 

df_test.registerTempTable("numeric")

In [46]:
# query 

sqlContext.sql("""SELECT * FROM numeric limit 2 """).show()

+-----------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|        892|     3|    Kelly, Mr. James|  male|34.5|    0|    0|330911|7.8292|     |       Q|
|        893|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|363272|   7.0|     |       S|
+-----------+------+--------------------+------+----+-----+-----+------+------+-----+--------+